{"class_name": "Model", "config": {"name": "model_23", "layers": [{"name": "decoder_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "decoder_input"}, "inbound_nodes": []}, {"name": "custom_decoder_emb_layer", "class_name": "Embedding", "config": {"name": "custom_decoder_emb_layer", "trainable": false, "batch_input_shape": [null, 1], "dtype": "float32", "input_dim": 2000, "output_dim": 100, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 1}, "inbound_nodes": [[["decoder_input", 0, 0, {}]]]}, {"name": "decoder_state_h1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 256], "dtype": "float32", "sparse": false, "name": "decoder_state_h1"}, "inbound_nodes": []}, {"name": "decoder_state_c1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 256], "dtype": "float32", "sparse": false, "name": "decoder_state_c1"}, "inbound_nodes": []}, {"name": "decoder_lstm1", "class_name": "LSTM", "config": {"name": "decoder_lstm1", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": true, "go_backwards": false, "stateful": false, "unroll": false, "units": 256, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}, "inbound_nodes": [[["custom_decoder_emb_layer", 0, 0, {}], ["decoder_state_h1", 0, 0, {}], ["decoder_state_c1", 0, 0, {}]]]}, {"name": "decoder_state_h2", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 256], "dtype": "float32", "sparse": false, "name": "decoder_state_h2"}, "inbound_nodes": []}, {"name": "decoder_state_c2", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 256], "dtype": "float32", "sparse": false, "name": "decoder_state_c2"}, "inbound_nodes": []}, {"name": "decoder_lstm2", "class_name": "LSTM", "config": {"name": "decoder_lstm2", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": true, "go_backwards": false, "stateful": false, "unroll": false, "units": 256, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}, "inbound_nodes": [[["decoder_lstm1", 0, 0, {}], ["decoder_state_h2", 0, 0, {}], ["decoder_state_c2", 0, 0, {}]]]}, {"name": "decoder_relu", "class_name": "Dense", "config": {"name": "decoder_relu", "trainable": true, "dtype": "float32", "units": 256, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["decoder_lstm2", 0, 0, {}]]]}, {"name": "decoder_dense", "class_name": "Dense", "config": {"name": "decoder_dense", "trainable": true, "dtype": "float32", "units": 2000, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["decoder_relu", 0, 0, {}]]]}], "input_layers": [["decoder_input", 0, 0], ["decoder_state_h1", 0, 0], ["decoder_state_c1", 0, 0], ["decoder_state_h2", 0, 0], ["decoder_state_c2", 0, 0]], "output_layers": [["decoder_dense", 0, 0], ["decoder_lstm1", 0, 1], ["decoder_lstm1", 0, 2], ["decoder_lstm2", 0, 1], ["decoder_lstm2", 0, 2]]}, "keras_version": "2.3.1", "backend": "tensorflow"}