{"class_name": "Model", "config": {"name": "model_22", "layers": [{"name": "encoder_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 30], "dtype": "float32", "sparse": false, "name": "encoder_input"}, "inbound_nodes": []}, {"name": "embedding_3", "class_name": "Embedding", "config": {"name": "embedding_3", "trainable": false, "batch_input_shape": [null, 30], "dtype": "float32", "input_dim": 2000, "output_dim": 100, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 30}, "inbound_nodes": [[["encoder_input", 0, 0, {}]]]}, {"name": "encoder_bi", "class_name": "Bidirectional", "config": {"name": "encoder_bi", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm1", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": true, "go_backwards": false, "stateful": false, "unroll": false, "units": 256, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "ave"}, "inbound_nodes": [[["embedding_3", 0, 0, {}]]]}, {"name": "encoder_bi_", "class_name": "Bidirectional", "config": {"name": "encoder_bi_", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm2", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": true, "go_backwards": false, "stateful": false, "unroll": false, "units": 256, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "ave"}, "inbound_nodes": [[["encoder_bi", 0, 0, {}]]]}, {"name": "encoder_avg_h1", "class_name": "Average", "config": {"name": "encoder_avg_h1", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["encoder_bi", 0, 1, {}], ["encoder_bi", 0, 3, {}]]]}, {"name": "encoder_avg_c1", "class_name": "Average", "config": {"name": "encoder_avg_c1", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["encoder_bi", 0, 2, {}], ["encoder_bi", 0, 4, {}]]]}, {"name": "encoder_avg_h2", "class_name": "Average", "config": {"name": "encoder_avg_h2", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["encoder_bi_", 0, 1, {}], ["encoder_bi_", 0, 3, {}]]]}, {"name": "encoder_avg_c2", "class_name": "Average", "config": {"name": "encoder_avg_c2", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["encoder_bi_", 0, 2, {}], ["encoder_bi_", 0, 4, {}]]]}], "input_layers": [["encoder_input", 0, 0]], "output_layers": [["encoder_avg_h1", 0, 0], ["encoder_avg_c1", 0, 0], ["encoder_avg_h2", 0, 0], ["encoder_avg_c2", 0, 0]]}, "keras_version": "2.3.1", "backend": "tensorflow"}